apache/nuttx/arch/arm/src/sam34/sam4cm_tc.c
static const struct sam_chconfig_s g_configs[] =
{
#ifdef CONFIG_SAM34_TC0
  {
    .chan   = 0,
    .base   = SAM_TC0_BASE,
    .pid     = SAM_PID_TC0,
    .irq     = SAM_IRQ_TC0,
#ifdef CONFIG_SAM34_TC0_CLK
    .clkset = PIO_TC0_CLK,
#else
    .clkset = 0,
#endif
#ifdef CONFIG_SAM34_TC0_TIOA
    .tioaset = PIO_TC0_IOA,
#else
    .tioaset = 0,
#endif
#ifdef CONFIG_SAM34_TC0_TIOB
    .tiobset = PIO_TC0_IOB,
#else
    .tiobset = 0,
#endif
  },
#endif /* CONFIG_SAM34_TC0 */

#ifdef CONFIG_SAM34_TC1
  {
    .chan    = 1,
    .base    = SAM_TC1_BASE,
    .pid     = SAM_PID_TC1,
    .irq     = SAM_IRQ_TC1,
#ifdef CONFIG_SAM34_TC1_CLK
    .clkset  = PIO_TC1_CLK,
#else
    .clkset  = 0,
#endif
#ifdef CONFIG_SAM34_TC1_TIOA
    .tioaset = PIO_TC1_IOA,
#else
    .tioaset = 0,
#endif
#ifdef CONFIG_SAM34_TC1_TIOB
    .tiobset = PIO_TC1_IOB,
#else
    .tiobset = 0,
#endif
  },
#endif /* CONFIG_SAM34_TC1 */

#ifdef CONFIG_SAM34_TC2
  {
    .chan = 2,
    .base    = SAM_TC2_BASE,
    .pid     = SAM_PID_TC2,
    .irq     = SAM_IRQ_TC2,
#ifdef CONFIG_SAM34_TC2_CLK
    .clkset  = PIO_TC2_CLK,
#else
    .clkset  = 0,
#endif
#ifdef CONFIG_SAM34_TC2_TIOA
    .tioaset = PIO_TC2_IOA,
#else
    .tioaset = 0,
#endif
#ifdef CONFIG_SAM34_TC2_TIOB
    .tiobset = PIO_TC2_IOB,
#else
    .tiobset = 0,
#endif
  },
#endif /* CONFIG_SAM34_TC2 */

#ifdef CONFIG_SAM34_TC3
  {
    .chan    = 3,
    .base    = SAM_TC3_BASE,
    .pid     = SAM_PID_TC3,
    .irq     = SAM_IRQ_TC3,
#ifdef CONFIG_SAM34_TC3_CLK
    .clkset  = PIO_TC3_CLK,
#else
    .clkset  = 0,
#endif
#ifdef CONFIG_SAM34_TC3_TIOA
    .tioaset = PIO_TC3_IOA,
#else
    .tioaset = 0,
#endif
#ifdef CONFIG_SAM34_TC3_TIOB
    .tiobset = PIO_TC3_IOB,
#else
    .tiobset = 0,
#endif
  },
#endif /* CONFIG_SAM34_TC3 */

#ifdef CONFIG_SAM34_TC4
  {
    .chan    = 4,
    .base    = SAM_TC4_BASE,
    .pid     = SAM_PID_TC4,
    .irq     = SAM_IRQ_TC4,
#ifdef CONFIG_SAM34_TC4_CLK
    .clkset  = PIO_TC4_CLK,
#else
    .clkset  = 0,
#endif
#ifdef CONFIG_SAM34_TC4_TIOA
    .tioaset = PIO_TC4_IOA,
#else
    .tioaset = 0,
#endif
#ifdef CONFIG_SAM34_TC4_TIOB
    .tiobset = PIO_TC4_IOB,
#else
    .tiobset = 0,
#endif
  },
#endif /* CONFIG_SAM34_TC4 */

#ifdef CONFIG_SAM34_TC5
  {
    .chan    = 5,
    .base    = SAM_TC5_BASE,
    .pid     = SAM_PID_TC5,
    .irq     = SAM_IRQ_TC5,
#ifdef CONFIG_SAM34_TC5_CLK
    .clkset  = PIO_TC5_CLK,
#else
    .clkset  = 0,
#endif
#ifdef CONFIG_SAM34_TC5_TIOA
    .tioaset = PIO_TC5_IOA,
#else
    .tioaset = 0,
#endif
#ifdef CONFIG_SAM34_TC5_TIOB
    .tiobset = PIO_TC5_IOB,
#else
    .tiobset = 0,
#endif
  },
#endif /* CONFIG_SAM34_TC5 */
};

#define ENABLED_CHANNELS (sizeof(g_configs)/sizeof(struct sam_chconfig_s))

static struct sam_chan_s g_channels[ENABLED_CHANNELS];

/* TC frequency data.  This table provides the frequency for each selection of TCCLK */

#define TC_NDIVIDERS   4
#define TC_NDIVOPTIONS 5

/* This is the list of divider values: divider = (1 << value) */

static const uint8_t g_log2divider[TC_NDIVIDERS] =
{
  1,                     /* TIMER_CLOCK1 -> div2 */
  3,                     /* TIMER_CLOCK2 -> div8 */
  5,                     /* TIMER_CLOCK3 -> div32 */
  7                      /* TIMER_CLOCK4 -> div128 */
};

/* TC register lookup used by sam_tc_setregister */

#define TC_NREGISTERS 3

static const uint8_t g_regoffset[TC_NREGISTERS] =
{
  SAM_TC_RA_OFFSET,     /* Register A */
  SAM_TC_RB_OFFSET,     /* Register B */
  SAM_TC_RC_OFFSET      /* Register C */
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/
/****************************************************************************
 * Low-level Helpers
 ****************************************************************************/
/****************************************************************************
 * Name: sam_takesem
 *
 * Description:
 *   Take the wait semaphore (handling false alarm wakeups due to the receipt
 *   of signals).
 *
 * Input Parameters:
 *   dev - Instance of the SDIO device driver state structure.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void sam_takesem(struct sam_chan_s *chan)
{
  /* Take the semaphore (perhaps waiting) */

  while (sem_wait(&chan->exclsem) != 0)
    {
      /* The only case that an error should occr here is if the wait was
       * awakened by a signal.
       */

      ASSERT(errno == EINTR);
    }
}

/****************************************************************************
 * Name: sam_regdump
 *
 * Description:
 *   Dump all timer/counter channel and global registers
 *
 * Input Parameters:
 *   chan  - The timer/counter channel state
 *   msg   - Message to print with the data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_SAM34_TC_REGDEBUG
static void sam_regdump(struct sam_chan_s *chan, const char *msg)
{
  uintptr_t base;

  base = chan->base;
  tmrinfo("TC%d [%08x]: %s\n", chan->chan, (int)base, msg);
  tmrinfo("  BMR: %08x QIMR: %08x QISR: %08x WPMR: %08x\n",
          getreg32(base+SAM_TC_BMR_OFFSET), getreg32(base+SAM_TC_QIMR_OFFSET),
          getreg32(base+SAM_TC_QISR_OFFSET), getreg32(base+SAM_TC_WPMR_OFFSET));

  base = chan->base;
  tmrinfo("TC%d Channel %d [%08x]: %s\n", chan->chan, chan->chan, (int)base, msg);
  tmrinfo("  CMR: %08x SSMR: %08x  RAB: %08x   CV: %08x\n",
          getreg32(base+SAM_TC_CMR_OFFSET), getreg32(base+SAM_TC_SMMR_OFFSET),
          getreg32(base+SAM_TC_RAB_OFFSET), getreg32(base+SAM_TC_CV_OFFSET));
  tmrinfo("   RA: %08x   RB: %08x   RC: %08x   SR: %08x\n",
          getreg32(base+SAM_TC_RA_OFFSET), getreg32(base+SAM_TC_RB_OFFSET),
          getreg32(base+SAM_TC_RC_OFFSET), getreg32(base+SAM_TC_SR_OFFSET));
  tmrinfo("  IMR: %08x\n",
          getreg32(base+SAM_TC_IMR_OFFSET));
}
#endif

/****************************************************************************
 * Name: sam_checkreg
 *
 * Description:
 *   Check if the current register access is a duplicate of the preceding.
 *
 * Input Parameters:
 *   chan    - The timer/counter peripheral state
 *   wr      - True:write access false:read access
 *   regval  - The register value associated with the access
 *   regaddr - The address of the register being accessed
 *
 * Returned Value:
 *   true:  This is the first register access of this type.
 *   flase: This is the same as the preceding register access.
 *
 ****************************************************************************/

#ifdef CONFIG_SAM34_TC_REGDEBUG
static bool sam_checkreg(struct sam_chan_s *chan, bool wr, uint32_t regaddr,
                         uint32_t regval)
{
  if (wr      == chan->wr &&      /* Same kind of access? */
      regaddr == chan->regaddr && /* Same register address? */
      regval  == chan->regval)    /* Same register value? */
    {
      /* Yes, then just keep a count of the number of times we did this. */

      chan->ntimes++;
      return false;
    }
  else
    {
      /* Did we do the previous operation more than once? */

      if (chan->ntimes > 0)
        {
          /* Yes... show how many times we did it */

          tmrinfo("...[Repeats %d times]...\n", chan->ntimes);
        }

      /* Save information about the new access */

      chan->wr      = wr;
      chan->regval  = regval;
      chan->regaddr = regaddr;
      chan->ntimes  = 0;
    }

  /* Return true if this is the first time that we have done this operation */

